@echo off
chcp 65001 >nul
title My IDS - Система обнаружения сетевых атак

echo.
echo =====================================================
echo     My IDS - Система обнаружения сетевых атак
echo     Запуск в обычном окне CMD
echo =====================================================
echo.

cd /d "C:\Users\nikit\PycharmProjects\ids"

echo [INFO] Запуск программы...
echo.

.\.venv\Scripts\python.exe -m src.ids.ids

echo.
echo =====================================================
echo Программа завершена.
echo Нажмите любую клавишу, чтобы закрыть окно...
echo =====================================================
pause